readme.org
* Emacs Configuration
  
  This document is an overview of my emacs configuration with notes explaining the why and how of each bit of code works. This document can be cloned in along with this repo if you would like to emulate my emacs config.

  I would however recomend you arive 

** Overview and References

*** How it works

    The intent of this file is to use org-babel to have org mode generate my init.el and other files as needed while providing documentation in place.
    See: https://orgmode.org/worg/org-contrib/babel/index.html

    Code can be embedded using code blocks with both syntax highlighting and export instructions this code below for example will set the python mode interpreter to python3 not the default python.

    #+begin_src emacs-lisp
      ;; example
    #+end_src
    
*** Conventions

    For this document configuration changes will be seperated into related groups for ease of understanding for example all items related to python could be together as will all org mode items. 

*** References and Good Information

    For my emacs adventure I am following along with one major source of information which is the emacs from scratch series by "system crafters". You can find these here.

    https://www.youtube.com/watch?v=74zOY-vgkyw&list=PLEoMzSkcN8oPH1au7H6B7bBJ4ZO7BXjSZ&t=0s

    There are tons of snippets in my code which are borrowed from this series and if you are looking for a good tour of emacs features this is great. I also am following along with these books.

    https://www.oreilly.com/library/view/gnu-emacs-pocket/1565924967/

    and

    https://masteringemacs.org/book

    I am a professional software engineer but I am mainly looking at emacs for its documentation and org mode. If I can fit it in with my professional activities (python, sql, plsql) even better.

** Configuration

*** Use Package

    Since we will use use-package to easily include and require packages lets get use-package very first. We also will point packages to elpa and melpa.

    #+begin_src emacs-lisp
      ;; Initialize package sources
      (require 'package)

      (setq package-archives '(("melpa" . "https://melpa.org/packages/")
                               ("org" . "https://orgmode.org/elpa/")
                               ("elpa" . "https://elpa.gnu.org/packages/")
                               ("tromey" . "https://tromey.com/elpa/")
                               ("melpa-stable" . "https://stable.melpa.org/packages/")
                               ))

      (add-to-list 'package-pinned-packages '(cider . "melpa-stable") t)
      (add-to-list 'package-pinned-packages '(magit . "melpa-stable") t)

      (package-initialize)
      (unless package-archive-contents
        (package-refresh-contents))

      ;; Initialize use-package on non-Linux platforms
      (unless (package-installed-p 'use-package)
        (package-install 'use-package))

      (unless (package-installed-p 'multtiple-cursors)
        (package-install 'multiple-cursors))

      (require 'use-package)
      (setq use-package-always-ensure t)

      ;; uncomment this as needed or run manually
      ;;(package-refresh-contents ) ;; also update from melpa etc

      #+end_src

*** Basic Settings

    We will turn off a number of things to make the window smaller. These settings just remove much of the window padding as well as memu bars. We will also turn the bell of and make it visible flash on the screen instead.

    The very last bit is to default our backups to a special folder. Emacs keeps temp files and if you do not do this you'll end up with ~ named files in every directory. Alternatively you can turn these backups off BUT its a great feature.

    #+begin_src emacs-lisp
      ;; some basics
      (scroll-bar-mode -1)          ; Disable visible scrollbar
      (tool-bar-mode -1)            ; Disable the toolbar
      (tooltip-mode -1)             ; Disable tooltips
      (set-fringe-mode 10)          ; Give some breathing room

      ;; Set up the visible bell
      ;; (setq visible-bell t) ;; linux windows
      ;; (setq visible-bell nil)
      (setq ring-bell-function (lambda ()  ;; macos
				 (invert-face 'mode-line)
				 (run-with-timer 0.1 nil 'invert-face 'mode-line)))

      ;; send backsups to one specific directory
      (setq backup-directory-alist '(("." . "~/Organization/EmacsBackups")))
    #+end_src

*** Powershell Windows Only

    Please note to run this on windows machines manually for now 

    M-x package-install RET powershell RET

    to get powershell working then you simply run M-x powershell 

    see https://www.reddit.com/r/emacs/comments/op8ue1/how_set_powershell_as_the_default_shell_which_mx/

    or https://docs.microsoft.com/en-us/archive/blogs/dotnetinterop/run-powershell-as-a-shell-within-emacs

    
    #+begin_src emacs-lisp

    (if
    (eq system-type 'windows-nt) 
      (progn
       (prefer-coding-system 'utf-8)
       (setq explicit-shell-file-name
        "C:/Users/csusggsn/AppData/Local/Programs/Git/bin/bash.exe")
       (setq shell-file-name explicit-shell-file-name)
       (add-to-list 'exec-path 
        "C:/Users/csusggsn/AppData/Local/Programs/Git/bin/bash.exe")
      ) 
    )

    #+end_src

*** Org Mode Changes
    
    Various configs for org mode

    #+begin_src emacs-lisp
      (defun old_greg/org-mode-setup ()
        (org-indent-mode)
        (variable-pitch-mode 0)
        (visual-line-mode 1))

      ;; Org Mode Configuration ------------------------------------------------------

      (defun old_greg/org-font-setup ()
        ;; Replace list hyphen with dot
        (font-lock-add-keywords 'org-mode
                                '(("^ *\\([-]\\) "
                                   (0 (prog1 () (compose-region (match-beginning 1) (match-end 1) "•")))))))

      ;; Set faces for heading levels
      (dolist (face '((org-level-1 . 1.2)
                      (org-level-2 . 1.1)
                      (org-level-3 . 1.05)
                      (org-level-4 . 1.0)
                      (org-level-5 . 1.1)
                      (org-level-6 . 1.1)
                      (org-level-7 . 1.1)
                      (org-level-8 . 1.1)))
        )

      (use-package org
        :hook (org-mode . old_greg/org-mode-setup)
        :config
        (setq org-ellipsis " ▾")

        (setq org-agenda-start-with-log-mode t)
        (setq org-log-done 'time)
        (setq org-log-into-drawer t)

        (custom-set-faces
         '(org-block-begin-line ((t (:background "#bd93f9" :foreground "#f8f8f2"))))
         '(org-block-end-line   ((t (:background "#bd93f9" :foreground "#f8f8f2")))))
        (require 'org-habit)
        (add-to-list 'org-modules 'org-habit)
        (setq org-habit-graph-column 60)

        (setq org-todo-keywords
              '((sequence "TODO(t)" "NEXT(n)" "|" "DONE(d!)")
                (sequence "BACKLOG(b)" "PLAN(p)" "READY(r)" "ACTIVE(a)" "REVIEW(v)" "WAIT(w@/!)" "HOLD(h)" "|" "COMPLETED(c)" "CANC(k@)")))

        (setq org-refile-targets
              '(("~/Organization/archive.org" :maxlevel . 1)
                ("~/Organization/todo.org" :maxlevel . 1)))

        ;; Save Org buffers after refiling!
        (advice-add 'org-refile :after 'org-save-all-org-buffers)

        (setq org-tag-alist
              '((:startgroup)
                                              ; Put mutually exclusive tags here
                (:endgroup)
                ("@errand" . ?E)
                ("@home" . ?H)
                ("@work" . ?W)
                ("agenda" . ?a)
                ("planning" . ?p)
                ("publish" . ?P)
                ("batch" . ?b)
                ("note" . ?n)
                ("idea" . ?i)
                ("Database Core" . ?c)
                ("Database Web" . ?w)
                ("Datavault" . ?v)
                ("Misc Creditsafe" . ?m)

                ))

        ;; Configure custom agenda views
        (setq org-agenda-custom-commands
              '(("d" "Dashboard"
                 ((agenda "" ((org-deadline-warning-days 7)))
                  (todo "NEXT"
                        ((org-agenda-overriding-header "Next Tasks")))
                  (tags-todo "agenda/ACTIVE" ((org-agenda-overriding-header "Active Projects")))))

                ("n" "Next Tasks"
                 ((todo "NEXT"
                        ((org-agenda-overriding-header "Next Tasks")))))

                ("W" "Work Tasks" tags-todo "+work-email")

                ;; Low-effort next actions
                ("e" tags-todo "+TODO=\"NEXT\"+Effort<15&+Effort>0"
                 ((org-agenda-overriding-header "Low Effort Tasks")
                  (org-agenda-max-todos 20)
                  (org-agenda-files org-agenda-files)))

                ("w" "Workflow Status"
                 ((todo "WAIT"
                        ((org-agenda-overriding-header "Waiting on External")
                         (org-agenda-files org-agenda-files)))
                  (todo "REVIEW"
                        ((org-agenda-overriding-header "In Review")
                         (org-agenda-files org-agenda-files)))
                  (todo "PLAN"
                        ((org-agenda-overriding-header "In Planning")
                         (org-agenda-todo-list-sublevels nil)
                         (org-agenda-files org-agenda-files)))
                  (todo "BACKLOG"
                        ((org-agenda-overriding-header "Project Backlog")
                         (org-agenda-todo-list-sublevels nil)
                         (org-agenda-files org-agenda-files)))
                  (todo "READY"
                        ((org-agenda-overriding-header "Ready for Work")
                         (org-agenda-files org-agenda-files)))
                  (todo "ACTIVE"
                        ((org-agenda-overriding-header "Active Projects")
                         (org-agenda-files org-agenda-files)))
                  (todo "COMPLETED"
                        ((org-agenda-overriding-header "Completed Projects")
                         (org-agenda-files org-agenda-files)))
                  (todo "CANC"
                        ((org-agenda-overriding-header "Cancelled Projects")
                         (org-agenda-files org-agenda-files)))))))

        (setq org-capture-templates
              `(("t" "Tasks / Projects")
                ("tt" "Task" entry (file+olp "~/Projects/Code/emacs-from-scratch/OrgFiles/Tasks.org" "Inbox")
                 "* TODO %?\n  %U\n  %a\n  %i" :empty-lines 1)

                ("j" "Journal Entries")
                ("jj" "Journal" entry
                 (file+olp+datetree "~/Projects/Code/emacs-from-scratch/OrgFiles/Journal.org")
                 "\n* %<%I:%M %p> - Journal :journal:\n\n%?\n\n"
                 ;; ,(dw/read-file-as-string "~/Notes/Templates/Daily.org")
                 :clock-in :clock-resume
                 :empty-lines 1)
                ("jm" "Meeting" entry
                 (file+olp+datetree "~/Projects/Code/emacs-from-scratch/OrgFiles/Journal.org")
                 "* %<%I:%M %p> - %a :meetings:\n\n%?\n\n"
                 :clock-in :clock-resume
                 :empty-lines 1)

                ("w" "Workflows")
                ("we" "Checking Email" entry (file+olp+datetree "~/Projects/Code/emacs-from-scratch/OrgFiles/Journal.org")
                 "* Checking Email :email:\n\n%?" :clock-in :clock-resume :empty-lines 1)

                ("m" "Metrics Capture")
                ("mw" "Weight" table-line (file+headline "~/Projects/Code/emacs-from-scratch/OrgFiles/Metrics.org" "Weight")
                 "| %U | %^{Weight} | %^{Notes} |" :kill-buffer t)))

        (define-key global-map (kbd "C-c j")
          (lambda () (interactive) (org-capture nil "jj")))

        (old_greg/org-font-setup))

      (defun old_greg/org-mode-visual-fill ()
        (setq visual-fill-column-width 145
              visual-fill-column-center-text t)
        (visual-fill-column-mode 1))

      (use-package visual-fill-column
        :hook (org-mode . old_greg/org-mode-visual-fill))

      (if
          (eq system-type 'windows-nt) 
          (setq org-agenda-files '("C:\\Organization\\Users\\csusggsn\\todo.org"))

        )

      (if
          (eq system-type 'darwin) 
          (setq org-agenda-files '("~/Organization/todo.org"))

        )

      (global-set-key (kbd "C-c a") 'org-agenda)
    #+end_src

*** Magit and Projectile

    These applications are just to allow for git and project management. Copied from system crafters

    #+begin_src emacs-lisp

      (use-package projectile
        :diminish projectile-mode
        :config (projectile-mode)
        :custom ((projectile-completion-system 'ivy))
        :bind-keymap
        ("C-c p" . projectile-command-map)
        :init
        ;; NOTE: Set this to the folder where you keep your Git repos!
        (when (file-directory-p "~/Projects/Code")
          (setq projectile-project-search-path '("~/Projects/Code")))
        (setq projectile-switch-project-action #'projectile-dired))

      (use-package counsel-projectile
        :config (counsel-projectile-mode))

      (use-package magit
        :bind (("C-x g" . magit-status)
               ("C-x C-g" . magit-status))
        :custom
        (magit-display-buffer-function #'magit-display-buffer-same-window-except-diff-v1))

    #+end_src

*** SQL and Oracle

    #+begin_src emacs-lisp
     (add-to-list 'load-path "~/.emacs.d/customizations")
     (load "sqlplus.el")
     (load "plsql.el")

    #+end_src

