readme.el
;; example

;; Initialize package sources
(require 'package)

(setq package-archives '(("melpa" . "https://melpa.org/packages/")
			 ("org" . "https://orgmode.org/elpa/")
			 ("elpa" . "https://elpa.gnu.org/packages/")
			 ("tromey" . "https://tromey.com/elpa/")
			 ("melpa-stable" . "https://stable.melpa.org/packages/")
			 ))

(add-to-list 'package-pinned-packages '(cider . "melpa-stable") t)
(add-to-list 'package-pinned-packages '(magit . "melpa-stable") t)

(package-initialize)
(unless package-archive-contents
  (package-refresh-contents))

;; Initialize use-package on non-Linux platforms
(unless (package-installed-p 'use-package)
  (package-install 'use-package))

(require 'use-package)
(setq use-package-always-ensure t)

;; uncomment this as needed or run manually
;;(package-refresh-contents ) ;; also update from melpa etc

;; some basics
(scroll-bar-mode -1)          ; Disable visible scrollbar
(tool-bar-mode -1)            ; Disable the toolbar
(tooltip-mode -1)             ; Disable tooltips
(set-fringe-mode 10)          ; Give some breathing room

;; Set up the visible bell
;; (setq visible-bell t) ;; linux windows
;; (setq visible-bell nil)
(setq ring-bell-function (lambda ()  ;; macos
			   (invert-face 'mode-line)
			   (run-with-timer 0.1 nil 'invert-face 'mode-line)))

;; send backsups to one specific directory
(setq backup-directory-alist '(("." . "~/Organization/EmacsBackups")))

(setq org-log-done t)
(setq org-agenda-files '("~/Organization/todo.org"
                         "~/Organization/scratchpad.org"
                         "C:\\Organization\\todo.org"))
(global-set-key (kbd "C-c a") 'org-agenda)

(add-to-list 'load-path "~/.emacs.d/customizations")
(load "sqlplus.el")
(load "plsql.el")
