readme.org
*** Clojure

    I will be spending time this year learning clojure and making a terminal app in it here are some ext for it

    Much of this configuration is just lifted from the brave clojure book see

    https://github.com/flyingmachine/emacs-for-clojure/

    Rather than just using their code however I've added it into my own init.el.

    Note I have cloned their customizations directory.


    #+begin_src emacs-lisp

      ;; The packages you want installed. You can also install these
      ;; manually with M-x package-install
      ;; Add in your own as you wish:
      (defvar my-packages
        '(;; makes handling lisp expressions much, much easier
          ;; Cheatsheet: http://www.emacswiki.org/emacs/PareditCheatsheet
          paredit

          ;; key bindings and code colorization for Clojure
          ;; https://github.com/clojure-emacs/clojure-mode
          clojure-mode

          ;; extra syntax highlighting for clojure
          clojure-mode-extra-font-locking

          ;; integration with a Clojure REPL
          ;; https://github.com/clojure-emacs/cider
          cider

          ;; allow ido usage in as many contexts as possible. see
          ;; customizations/navigation.el line 23 for a description
          ;; of ido
          ido-completing-read+

          ;; Enhances M-x to allow easier execution of commands. Provides
          ;; a filterable list of possible commands in the minibuffer
          ;; http://www.emacswiki.org/emacs/Smex
          smex

          ;; project navigation
          ;;projectile

          ;; colorful parenthesis matching
          rainbow-delimiters

          ;; edit html tags like sexps
          tagedit

          ;; git integration
          ;;magit
          ))

      ;; On OS X, an Emacs instance started from the graphical user
      ;; interface will have a different environment than a shell in a
      ;; terminal window, because OS X does not run a shell during the
      ;; login. Obviously this will lead to unexpected results when
      ;; calling external utilities like make from Emacs.
      ;; This library works around this problem by copying important
      ;; environment variables from the user's shell.
      ;; https://github.com/purcell/exec-path-from-shell
      (if (eq system-type 'darwin)
          (add-to-list 'my-packages 'exec-path-from-shell))

      (dolist (p my-packages)
        (when (not (package-installed-p p))
          (package-install p)))


      (add-to-list 'load-path "~/.emacs.d/vendor")


      ;;;;
      ;; Customization
      ;;;;

      ;; Add a directory to our load path so that when you `load` things
      ;; below, Emacs knows where to look for the corresponding file.
      ;; (add-to-list 'load-path "~/.emacs.d/customizations")

      ;; Sets up exec-path-from-shell so that Emacs will use the correct
      ;; environment variables
      (load "shell-integration.el")
      (load "dired+.el")

      ;; These customizations make it easier for you to navigate files,
      ;; switch buffers, and choose options from the minibuffer.
      (load "navigation.el")

      ;; These customizations change the way emacs looks and disable/enable
      ;; some user interface elements
      (load "ui.el")

      ;; These customizations make editing a bit nicer.
      (load "editing.el")

      ;; Hard-to-categorize customizations
      (load "misc.el")

      ;; For editing lisps
      (load "elisp-editing.el")

      ;; Langauage-specific
      (load "setup-clojure.el")
      (load "setup-js.el")
      (custom-set-variables
       ;; custom-set-variables was added by Custom.
       ;; If you edit it by hand, you could mess it up, so be careful.
       ;; Your init file should contain only one such instance.
       ;; If there is more than one, they won't work right.
       '(coffee-tab-width 2)
       '(package-selected-packages
         (quote
          (magit tagedit rainbow-delimiters projectile smex ido-completing-read+ cider clojure-mode-extra-font-locking clojure-mode paredit exec-path-from-shell))))
      (custom-set-faces
       ;; custom-set-faces was added by Custom.
       ;; If you edit it by hand, you could mess it up, so be careful.
       ;; Your init file should contain only one such instance.
       ;; If there is more than one, they won't work right.
       )
    #+end_src

*** Keyboard Changes

    Any simple keymap changes are here there can be more specific key binds per package which will be stored with their associated package.

    #+begin_src emacs-lisp
      (global-set-key (kbd "<escape>") 'keyboard-escape-quit) ;; Make ESC quit prompts

      (use-package general
	:after evil
	:config
	(general-create-definer old_greg/leader-keys
				:keymaps '(normal insert visual emacs)
				:prefix "SPC"
				:global-prefix "C-SPC")

	(old_greg/leader-keys
	 "t"  '(:ignore t :which-key "toggles")
	 "tt" '(counsel-load-theme :which-key "choose theme")
	 "fde" '(lambda () (interactive) (find-file (expand-file-name "~/.emacs.d/Emacs.org")))))

      (use-package evil
	:init
	(setq evil-want-integration t)
	(setq evil-want-keybinding nil)
	(setq evil-want-C-u-scroll t)
	(setq evil-want-C-i-jump nil)
	:config
	(evil-mode 1)
	(define-key evil-insert-state-map (kbd "C-g") 'evil-normal-state)
	(define-key evil-insert-state-map (kbd "C-h") 'evil-delete-backward-char-and-join)


	;; Use visual line motions even outside of visual-line-mode buffers
	(evil-global-set-key 'motion "j" 'evil-next-visual-line)
	(evil-global-set-key 'motion "k" 'evil-previous-visual-line)

	(evil-set-initial-state 'messages-buffer-mode 'normal)
	(evil-set-initial-state 'dashboard-mode 'normal)
        (evil-set-initial-state 'ibuffer-mode 'normal)
        (evil-set-initial-state 'bookmark-bmenu-mode 'normal)
        (evil-set-initial-state 'dired-mode 'emacs)
        (evil-set-initial-state 'sunrise-mode 'emacs))

      (use-package evil-collection
	:after evil
	:config
	(evil-collection-init))


    #+end_src

*** Cursors

    I am using the multiple cursor package. In emacs 28 I believe I can remove this but for now

    https://github.com/magnars/multiple-cursors.el
    
    M-x package-install multiple-cursors

    #+begin_src emacs-lisp
      (require 'multiple-cursors)
      (global-set-key (kbd "C-S-c C-S-c") 'mc/edit-lines)
      (global-set-key (kbd "C->") 'mc/mark-next-like-this)
      (global-set-key (kbd "C-<") 'mc/mark-previous-like-this)
      (global-set-key (kbd "C-c C-<") 'mc/mark-all-like-this)
    #+end_src 

*** Appearance

    I am using doom emacs bar as well as a theme from there for basic appearnance as well as some specific fonts. Please ensure you have IBM Plex Mono fonts installed if you want to use this.

    Please note I have some lines here commented in and out to account for different machines. I use emacs mostly in a Debian VM but I also use it on Macos and Windows natively for work. Font height and $PATH work different for macs.

    For all the icons fonts on windows you will need to "install" them. To do this follow the details 

    https://github.com/hlissner/doom-emacs/issues/2575

    The powershell commands are
     cd $tempFonts
     $destination = (New-Object -ComObject Shell.Application).Namespace(0x14)
     ls *.ttf | % { $destination.CopyHere($_.FullName, 0x10) }     
    

    #+begin_src emacs-lisp
	    (global-hl-line-mode 1)       ; HL Lines globally on
	    (set-face-background hl-line-face "gray23")
	    ;; hidpi
	    ;;(set-face-attribute 'default nil :font "IBM Plex Mono" :height 170)
	    ;; normal screens
	    (set-face-attribute 'default nil :font "IBM Plex Mono" :height 135)

	    (use-package doom-modeline
	      :ensure t
	      :init (doom-modeline-mode 1)
	      :custom ((doom-modeline-height 13)))

	    ;; NOTE: The first time you load your configuration on a new machine, you'll
	    ;; need to run the following command interactively so that mode line icons
	    ;; display correctly:
	    ;;
	    ;; M-x all-the-icons-install-fonts
	    ;; icons 
	    (use-package all-the-icons)

	    (use-package doom-themes
	      :init (load-theme 'doom-dracula t))

	    (use-package rainbow-delimiters
	      :hook (prog-mode . rainbow-delimiters-mode))

      (setq doom-modeline-modal-icon nil)

    #+end_src

**** Line Numbers

     We turn on line numbers but turn them off in various modes like terminal and dired.

    #+begin_src emacs-lisp
            (column-number-mode)
            (setq display-line-numbers-type 'relative)
            (global-display-line-numbers-mode t)

            ;; Disable line numbers for some modes
            (dolist (mode '(term-mode-hook
                            dired-mode-hook
                            shell-mode-hook
                            org-mode-hook
                            eshell-mode-hook))
              (add-hook mode (lambda () (display-line-numbers-mode 0))))
    #+end_src

